Repository: miurahr/translate-django-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: (Do the same as with ``admin/base_site.html`` in the previous section -- copy it from the default directory to your custom template directory.) Edit the file, and you'll see it uses a template variable called ``app_list``.
ja: (前セクションで "admin/base_site.html" にしたことと同じことをしてください。デフォルトのディレクトリからコピーして、カスタムテンプレートのディレクトリに配置してください)。編集してみると "app_list" というテンプレート変数が使われているのが見えるでしょう。

source: (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the regular expressions are compiled at load time.
ja: (もしそれらのどれとも一致しなかった時、 Django は特殊ケースである404ビューを呼び出します。)正規表現はロード時にコンパイルされるため、これらは非常に高速に動作します。

source: (where ``django`` is the directory of your clone that contains ``setup.py``) to link your cloned checkout into a virtual environment.
ja: (ここで``django`` は、 ``setup.py`` が含まれている、複製のディレクトリです) このコマンドにより、仮想環境内にこの複製をインストールできます。

source: **Keep in mind that while we'll be using an older revision of Django's trunk for the purposes of the tutorial below, you should always use the current development revision of Django when working on your own patch for a ticket!**
ja: **チュートリアルでは trunk ではない古いリビジョンの Django を使用しますが、自分のパッチを作成する場合は Django の最新の開発版を使用する必要があります!**

source: :class:`~django.db.models.CharField`, for example, requires that you give it a :attr:`~django.db.models.CharField.max_length`.
ja: 例えば `~django.db.models.CharField` には :attr:`~django.db.models.CharField.max_length` を指定する必要があります。

source: :doc:`The release of Django 1.0 </releases/1.0>` comes with a promise of API stability and forwards-compatibility.
ja: :doc:`Django１．０リリース </releases/1.0>` は、API安定性と前方互換性の保証とともになされました。

source: :func:`~django.conf.urls.url` argument: kwargs
ja: :func:`~django.conf.urls.url` 引数: kwargs

source: :func:`~django.conf.urls.url` argument: name
ja: :func:`~django.conf.urls.url` 引数: name

source: :func:`~django.conf.urls.url` argument: regex
ja: :func:`~django.conf.urls.url` 引数: regex

source: :func:`~django.conf.urls.url` argument: view
ja: :func:`~django.conf.urls.url` 引数: view

source: :mod:`django.contrib.auth` -- An authentication system.
ja: :mod:`django.contrib.auth` - 認証システム

source: :mod:`django.contrib.contenttypes` -- A framework for content types.
ja: :mod:`django.contrib.contenttypes` - コンテンツタイプフレームワーク

source: :mod:`django.contrib.messages` -- A messaging framework.
ja: :mod:`django.contrib.messages` - メッセージフレームワーク

source: :mod:`django.contrib.sessions` -- A session framework.
ja: :mod:`django.contrib.sessions` - セッションフレームワーク

source: :mod:`django.contrib.staticfiles` -- A framework for managing static files.
ja: :mod:`django.contrib.staticfiles` - 静的ファイルの管理フレームワーク

source: :ref:`Install an official release <installing-official-release>`.
ja: :ref:`正式リリースのインストール<installing-official-release>`。

source: :ref:`Install the latest development version <installing-development-version>`.
ja: :ref:`最新の開発版のインストール<installing-development-version>`。

source: A :class:`~django.db.models.Field` can also have various optional arguments; in this case, we've set the :attr:`~django.db.models.Field.default` value of ``votes`` to 0.
ja: :class:`~django.db.models.Field` はいつくかオプションの引数も取れます。今回の場合、 ```votes`` の :attr:`~django.db.models.Field.default` 値を 0 に設定しました。

source: A :doc:`caching framework </topics/cache>` that integrates with memcached or other backends.
ja: memcached などのバックエンドを組み込んだ :doc:`キャッシュフレームワーク </topics/cache>` 。

source: A :doc:`syndication framework </ref/contrib/syndication>` that makes creating RSS and Atom feeds as easy as writing a small Python class.
ja: 小さな Python クラスを書くだけで簡単に RSS や Atom フィードを生成できる :doc:`配信フィードフレームワーク </ref/contrib/syndication>` 。

source: A URL pattern is simply the general form of a URL - for example: ``/newsarchive/<year>/<month>/``.
ja: URLパターンはURLをシンプルに一般化したものです。例えば "/newsarchive/<year>/<month>/" などです。

source: A clean, elegant URL scheme is an important detail in a high-quality Web application.
ja: すっきりとして洗練された URL スキームは、高品質な Web アプリケーションを実 現する上で重要な要素です。

source: A dynamic admin interface: it's not just scaffolding -- it's the whole house
ja: 作業場 (scaffold) ではなく完成品 (whole house) の、動的な admin インタフェース

source: A good first look at writing tests for Django can be found in the documentation on :doc:`/topics/testing/overview`.
ja: Djangoのテストを書くために最初に見るべきものは、:doc:`/topics/testing/overview`にある文書です。

source: A good way to do this is to write your new tests first, before making any changes to the code.
ja: れをするには､コードに変更を加える前に先にテストを書くのが良いでしょう｡

source: A public site that lets people view polls and vote in them.
ja: ユーザが投票したり結果を表示したりできる公開用サイト

source: A quick rundown:
ja: 簡単に説明:

source: A regression test should be written in such a way that it will fail while the bug still exists and pass once the bug has been fixed.
ja: レグレッションテストは､バグが存在しているときに落ちるように書き､バグが修正された後にパスするように書かれるべきです｡

source: A table of contents for your app, it contains a simple mapping between URL patterns and Python callback functions.
ja: URLconf はいわばアプリケーションの目次にあたり、 URL のパターンを Python のコールバック関数に対応づけています。

source: API stability
ja: API安定性

source: Activating models
ja: モデルを有効にする

source: Add the following code on line 269 right before the ``AdminFileWidgetTest`` class::
ja: 次のコードを２６９行の ``AdminFileWidgetTest`` クラスの直前に追加してください::

source: Add the following on line 925 of ``django/docs/ref/models/fields.txt`` beneath the existing docs for ``URLField``::
ja: 以下のコードを ``django/docs/ref/models/fields.txt`` の 925 行目にある ``URLField`` のドキュメントの下に追記してください｡

source: Add the following to ``polls/views.py``:
ja: 以下を ``polls/views.py`` に追加してください:

source: Adding related objects
ja: リレーションを張ったオブジェクトの追加

source: Advanced tutorial: How to write reusable apps
ja: 高度なチュートリアル: 再利用可能アプリの書き方

source: After a ticket has a patch, it needs to be reviewed by a second set of eyes.
ja: チケットにパッチが追加されたあとは、別の人間の目でレビューされる必要があります。

source: After all, a regression test that passes regardless of whether a bug is present is not very helpful at preventing that bug from reoccurring down the road.
ja: ともかく､バグが存在していようとも通るテストは将来バグが再発するのを防ぐのに､何の役にもたちません｡

source: After all, the index is probably the most important page of the admin, and it should be easy to use.
ja: なんといっても index ページは admin のなかで最も重要なページで、使いやすくあるべきです。

source: After reading those, if you want something a little meatier to sink your teeth into, there's always the `Python unittest documentation`__.
ja: Dive Into Python を読んだあと､もう少し情報が欲しい場合は `Python のユニットテスト`__ のドキュメントを参照してください｡

source: After the previous tutorials, our project should look like this::
ja: 前のチュートリアルを終えると、プロジェクトはこのようになっていたはずです::

source: After those, if you're still hungry for more information about contributing, you can always browse through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`.
ja: 貢献について､より多くの情報を知りたいなら､ :doc:`貢献についての Django のドキュメント </internals/contributing/index>` を参照してください｡

source: After uploading a patch or submitting a pull request, be sure to update the ticket metadata by setting the flags on the ticket to say "has patch", "doesn't need tests", etc, so others can find it for review.
ja: パッチをアップロードしたりプルリクエストを送信したあとは、チケットのメタデータから "has patch" フラグを設定してください。"doesn't need tests" や、その他のメタデータはレビューのためにあります。

source: After writing your tests, you then run them to make sure that they do indeed fail (since you haven't fixed that bug or added that feature yet).
ja: テストを書いた後には､テストを走らせて確かに落ちることを確認します (バグ修正や昨日の追加はまだしてないので落ちます)｡

source: Again, don't worry if you can't understand the template language -- we'll cover that in more detail in Tutorial 3.
ja: しつこいようですが、テンプレート言語の理解できなくても心配しないでください。より詳細にはチュートリアル3でカバーされます。

source: All Django wants is that :class:`~django.http.HttpResponse`.
ja: Django にとって必要なのは :class:`~django.http.HttpResponse` です。

source: Also note that the column header for ``was_published_recently`` is, by default, the name of the method (with underscores replaced with spaces), and that each line contains the string representation of the output.
ja: ``was_published_recently`` のカラムヘッダのデフォルト値がメソッドの名前になっている (アンダースコアは空白に置き換わっている)こと、各行が戻り値の文字列となっていることにも注意して下さい。

source: Also, releases of third-party packages are less likely to be compatible with the development version than with the latest stable release.
ja: また、サードパーティパッケージの公開版は、最新の安定版の互換性に比べれば、開発版とも互換性が下がってしまうでしょう。

source: Also, the O'Reilly book "Mastering Regular Expressions" by Jeffrey Friedl is fantastic.
ja: オライリーから出版されている Jeffery Friendl の "Mastering Reglar Expressions" も参考になります。

source: Although you can use Django without a database, it comes with an `object-relational mapper`_ in which you describe your database layout in Python code.
ja: データベースなしで Django を使うこともできますが、 Django には Python コードでデータベースのレイアウトを記述した `オブジェクトリレーショナルマッパー`_ (object-relational mapper) が付属しています。

source: Always refer to the documentation that corresponds to the version of Django you're using!
ja: 常に、使っているDjangoのバージョンに関する文書を参照するようにしてください！

source: Amend URLconf
ja: URLconfの追加

source: Amend views
ja: Viewsの追加

source: An admin site that lets you add, change and delete polls.
ja: 投票項目の追加、変更、削除を行うための管理 (admin) サイト

source: And there's no need to add URL cruft such as ``.html`` -- unless you want to, in which case you can do something like this::
ja: また、 ``.html`` のような文字列を URL に追加する必要もありません。ただし、次のようにすれば、表現できます::

source: Arbitrary keyword arguments can be passed in a dictionary to the target view.
ja: 任意のキーワード引数を辞書として対象のビューに渡せます。

source: As long as you don't see any failures, you're good to go.
ja: テストが失敗しなければ､先に進みましょう｡

source: Aside from the HTML generated by the server, web applications generally need to serve additional files — such as images, JavaScript, or CSS — necessary to render the complete web page.
ja: サーバで生成するHTML以外に、Webアプリケーションは一般的に完全なWebページをレンダリングするために、画像、JavaScript、CSSなど必要なファイルを提供する必要があります。

source: Basic testing strategies
ja: 基本的なテスト方針

source: Because Django was developed in a fast-paced newsroom environment, it was designed to make common Web-development tasks fast and easy.
ja: Django は変転の激しいニュースルーム環境で開発された経緯から、よくある Web 開発タスクを迅速かつ簡単化するように設計されました。

source: Because the URL patterns are regular expressions, there really is no limit on what you can do with them.
ja: URL パターンは正規表現であるため、正規表現で実現できる限り制限はありません。

source: Before we make those changes though, we're going to write a couple tests to verify that our modification functions correctly and continues to function correctly in the future.
ja: 変更を加える前に､変更が正しく動作し､これからも動作し続けることを確認するためにテストをいくつか追加します｡

source: Before you can use Django, you'll need to get it installed.
ja: Django を使う前に、インストールをする必要があります。

source: Before you get too into writing patches for Django, there's a little more information on contributing that you should probably take a look at:
ja: Django へのパッチを書き始める前に､貢献するために見ておいたほうがいい情報があります:

source: Being a Python Web framework, Django requires Python.
ja: PythonのWebフレームワークであるため、DjangoにはPythonが必要です。

source: Blog homepage -- displays the latest few entries.
ja: Blog ホームページ - 最新エントリーをいくつか表示

source: Both of these are considered to be test failures.
ja: これらは共にテスト失敗となります。

source: But first we need to tell our project that the ``polls`` app is installed.
ja: でもその前に ``polls`` アプリケーションをインストールしたことをプロジェクトに教えてやる必要があります。

source: But if it grew more sophisticated and required modification of Django's standard admin templates for some of its functionality, it would be more sensible to modify the *application's* templates, rather than those in the *project*.
ja: しかしより凝ったものに成長したり、機能のため標準の admin テンプレートの変更は必要となった場合、 *アプリケーションの* テンプレートを編集するのは、 *プロジェクト* のそれを編集するより賢い選択になるでしょう。

source: But if you don't, `Dive Into Python`__ is a fantastic (and free) online book for beginning Python programmers.
ja: もしそうでない場合、 `Dive Into Python`__ は Python プログラマーになるための素晴らしい (かつ無料の) オンラインドキュメントです。

source: But this testing thing looks kinda hard...
ja: しかしテストをすることはちょっとむずかしい...

source: But where's our poll app?
ja: ところで、 polls アプリはどこにあるんでしょう？

source: But, don't do that.
ja: とはいえ、やめてください。

source: By default, :setting:`INSTALLED_APPS` contains the following apps, all of which come with Django:
ja: デフォルトでは、 :settings:`INSTALLED_APPS` には以下のアプリケーションがはいっています。

source: By default, it displays all the apps in :setting:`INSTALLED_APPS` that have been registered with the admin application, in alphabetical order.
ja: デフォルトでは、 :settings:`INSTALLED_APPS` の全てのアプリを表示します。つまり admin アプリケーションに登録されたアプリケーションを、アルファベット順に表示されるということです。

source: By default, the :djadmin:`runserver` command starts the development server on the internal IP at port 8000.
ja: デフォルトでは :djadmin:`runserver` コマンドは内部 IP のポート 8000 で起動します。

source: By the end of this tutorial, you should have a basic understanding of both the tools and the processes involved.
ja: このチュートリアルを終えると、関連するツールとプロセス両方についての基本的な理解を得ることができます。

source: Bypassing manage.py
ja: manage.py を使わずに済ませる方法

source: Change the "Date published" by clicking the "Today" and "Now" shortcuts.
ja: 「今日」や「現在」ショートカットをクリックして、「Date published」を変更してみましょう。

source: Changing the port
ja: ポート番号の変更

source: Comment action -- handles posting comments to a given entry.
ja: コメント投稿 - エントリーに対するコメントの投稿を受付

source: Congratulations, you've generated your very first Django patch!
ja: おめでとうございます!Django への最初のパッチができました!

source: Consequently, we'll be using the revision of Django just prior to that, `commit 39f5bc7fc3a4bb43ed8a1358b17fe0521a1a63ac`__.
ja: よって `commit 39f5bc7fc3a4bb43ed8a1358b17fe0521a1a63ac`__ が適用される前の Django のリビジョンを使用します。

source: Contributing back to Django itself is the best way to see your own concerns addressed.
ja: その願いを叶える最適な方法は Django 自体への貢献です。

source: Contributing doesn't necessarily always mean writing a patch from scratch.
ja: 貢献する際にはいつもスクラッチからパッチを書くというわけではありません。

source: Convert the URLconf.
ja: そのURLconfを変換する

source: Create a database schema (``CREATE TABLE`` statements) for this app.
ja: アプリケーションのデータベーススキーマを作成 (``CREATE TABLE`` 文を実行) できます。

source: Creating a project
ja: プロジェクトを作成する

source: Creating an admin user
ja: 管理者ユーザの作成

source: Creating models
ja: モデルの作成

source: Customize the admin change list
ja: 管理サイトのチェンジリストページをカスタマイズする

source: Customize the admin form
ja: admin フォームのカスタマイズ

source: Customize the admin index page
ja: admin index ページをカスタムする

source: Customize the admin look and feel
ja: 管理サイトのルック & フィールをカスタマイズする

source: Customize your *app's* look and feel
ja: *アプリ* の構造をカスタマイズする

source: Customizing your *application's* templates
ja: *アプリケーション用の* テンプレートをカスタマイズする

source: Customizing your *project's* templates
ja: *プロジェクト* テンプレートをカスタムする。

source: Database setup
ja: Database の設定

source: Dates get a "Today" shortcut and calendar popup, and times get a "Now" shortcut and a convenient popup that lists commonly entered times.
ja: 日付 (dates) のカラムには「今日 (today)」 へのショートカットとカレンダーポップアップボタンがあります。

source: Day-based archive page -- displays all entries in the given day.
ja: 日ごとのアーカイブページ - 指定された日の全てのエントリーを表示

source: Delete -- Displays a delete confirmation page.
ja: 削除 (Delete) – 削除確認ページを表示します。

source: Design your URLs
ja: URL を設計する

source: Design your model
ja: モデルの設計

source: Design your templates
ja: テンプレートを設計する

source: Dive Into Python (a free online book for beginning Python developers) includes a great `introduction to Unit Testing`__.
ja: Dive Into Python (Python初心者のための､オンラインの無料の本) では素晴らしい `初めてのユニットテスト`__ という章があります｡

source: Django apps are "pluggable": You can use an app in multiple projects, and you can distribute apps, because they don't have to be tied to a given Django installation.
ja: Django アプリケーションは「プラガブル (pluggable)」です。アプリケーショ ンは特定の Django インストールに結び付いていないので、アプリケーションを複数のプロジェクトで使ったり、単体で配布したりできます。

source: Django at a glance
ja: Django の概要

source: Django encourages beautiful URL design and doesn't put any cruft in URLs, like ``.php`` or ``.asp``.
ja: Django は美しい URL の設計を助け、 ``.php`` や ``.asp`` のようなお粗末なゴミを URL に入れさせません。

source: Django has a template search path, which allows you to minimize redundancy among templates.
ja: テンプレート間の冗長を最小化させられるように、Djangoにはテンプレートの検索パスがあります。

source: Django is 100% Python, so if you've got minimal comfort with Python you'll probably get a lot more out of Django.
ja: Django は 100% Python です。 ほんの最小限 Python を理解するだけで Django をより深く理解できます。

source: Django solves the problem of creating a unified interface for site administrators to edit content.
ja: Django は、サイト管理者向けの一元化されたコンテンツ編集インタフェースを提供しています。

source: Django starts at the first regular expression and makes its way down the list, comparing the requested URL against each regular expression until it finds one that matches.
ja: Django ははじめの正規表現から開始し、リストを順に下に見ていきます。リクエストされたURLと各正規表現を、マッチするものが見つかるまで比較します。

source: Django was written in a newsroom environment, with a very clear separation between "content publishers" and the "public" site.
ja: Django はニュースルーム環境で開発されました。ニュースルーム環境では、 「コンテンツの作成者 (content publisher)」と「公開 (public) 」サイトをきわめて明確に区別しています。

source: Django will find the match at ``'^polls/'``
ja: Django は ``'^polls/'`` へのマッチを検出します。

source: Django's entire test suite has over 4800 different tests, so it can take anywhere from 5 to 15 minutes to run, depending on the speed of your computer.
ja: Django 全体のテストスイートは 4800 以上のテストが含まれており、コンピュータの速度により 5 〜 15分程度かかります。

source: Doesn't match what you see?
ja: 自分のレイアウトと違う場合

source: Dots indicate passing tests.
ja: ドットはテストの成功を表しています。

source: Download the Django source code repository using the following command::
ja: 以下のコマンドで Django のソースコードリポジトリをダウンロードします::

source: Each :class:`~django.db.models.DateTimeField` gets free JavaScript shortcuts.
ja: 各 :class:`~django.db.models.DateTimeField` は JavaScript ショートカットがついています。

source: Each field is represented by an instance of a :class:`~django.db.models.Field` class -- e.g., :class:`~django.db.models.CharField` for character fields and :class:`~django.db.models.DateTimeField` for datetimes.
ja: 各フィールドは :class:`~django.db.models.Field` クラスのインスタンスとして表現されています。例えば、 :class:`~django.db.models.CharField` は文字のフィールドで、 :class:`~django.db.models.DateTimeField` は日時フィー ルドです。

source: Each type of field knows how to display itself in the Django admin.
ja: 各種のフィールドには Django 管理サイトでデー タを表示する方法が定義されています。

source: Each view gets passed a request object -- which contains request metadata -- and the values captured in the regex.
ja: 各ビューは、リクエストのメタデータを含むリクエストオブジェクトと、正規表現でキャプチャされた値を受け取ります。

source: Each view is responsible for doing one of two things: Returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :class:`~django.http.Http404`.
ja: 各ビューには二つの役割があります: 一つはリクエストされたページのコ ンテンツを含む :class:`~django.http.HttpResponse` オブジェクトを返すこと、もう一つは :class:`~django.http.Http404` のような例外の送出です。

source: Each view is responsible for doing one of two things: returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :exc:`~django.http.Http404`.
ja: 各ビューには二つの役割があります: 一つはリクエストされたページのコ ンテンツを含む :class:`~django.http.HttpResponse` オブジェクトを返すこと、もう一つは :exc:`~django.http.Http404` のような例外の送出です。

source: Email the package to a friend.
ja: パッケージを友人にメールで送る

source: Enjoy the free API
ja: 自動生成される API で楽しむ

source: Enter the admin site
ja: admin サイトに入る

source: Enter your desired username and press enter.
ja: ユーザー名とパスワードを入力し、エンターを押下してください:

source: Entry "detail" page -- permalink page for a single entry.
ja: エントリー詳細ページ - 1エントリーへのパーマリンク (permalink) ページ

source: Exceptions
ja: 例外

source: Explore the free admin functionality
ja: admin の機能を探究してみる

source: Finally, Django uses the concept of "template inheritance".
ja: さらには、Djangoは、"template inheritance"のコンセプトを利用しています。

source: Finally, a performance note: these regular expressions are compiled the first time the URLconf module is loaded.
ja: パフォーマンスノート: 正規表現は URLconf モジュールが読み込まれた最初にコンパイルされるので、

source: Find the ``AdminURLFieldWidget`` class on line 302 and add the following ``render`` method after the existing ``__init__`` method::
ja: 302行目にある ``AdminURLFieldWidget`` クラスを見つけて､以下の ``render`` メソッドをすでにある ``__init__`` メソッドの下に追加してください::

source: Finding your first real ticket
ja: 実際にチケットを探してみましょう

source: First time contributors should also read Django's :doc:`documentation for first time contributors</internals/contributing/new-contributors/>`.
ja: Django への初めての貢献者は :doc:`初めての貢献者へのドキュメント </internals/contributing/new-contributors/>` を読んでください｡

source: First we'll need to create a user who can login to the admin site.
ja: まず、管理サイトにログインできるユーザを作る必要があります。

source: First, open the ``polls/urls.py`` URLconf and change it like so:
ja: まず、``polls/urls.py`` ファイルを開いてURLconf を次のように変更します:

source: For bug fix patches, this means writing a regression test to ensure that the bug is never reintroduced into Django later on.
ja: リグレッションテストを書くことで､ Django にバグを再混入していないと後に保証できます｡

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, '2005', '05', '39323')``.
ja: 例えば、ユーザが "/articles/2005/05/39323/" という URL をリクエストすると、 Django は ``news.views.article_detail(request, '2005', '05', '39323')`` のような関数呼び出しを行います。

source: For example, in a request to ``http://www.example.com/myapp/``, the URLconf will look for ``myapp/``.
ja: 例えば ``http://www.example.com/myapp/`` へのリクエストでは、 URLconf は ``myapp/`` を見ます。

source: For instance, this command starts the server on port 8080:
ja: このコマンドによってポート 8080 で起動させれます:

source: For more information on writing documentation, including an explanation of what the ``versionadded`` bit is all about, see :doc:`/internals/contributing/writing-documentation`.
ja: ```versionadded``関係の完全な説明を含め、ドキュメントの書き方についてもっと知りたい場合は :doc:`/internals/contributing/writing-documentation` を参照してください｡

source: For patches containing new features, you'll need to include tests which ensure that the new features are working correctly.
ja: 新機能を含むパッチでは､その新機能が正しく動作すると保証するためにテストが必要です｡

source: For small projects, this isn't a big deal, because you can just keep the static files somewhere your web server can find it.
ja: 小さなプロジェクトではこのことは大きな問題になりません。

source: For the minimalists
ja: ミニマリストのために

source: For the most part though, this tutorial tries to explain as much as possible, so that it can be of use to the widest audience.
ja: このチュートリアルでは、できるだけ多くの方が使用できるように可能な限り解説したいと思います。

source: For this tutorial and the ticket we're working on, testing against SQLite is sufficient, however, it's possible (and sometimes necessary) to :ref:`run the tests using a different database <running-unit-tests-settings>`.
ja: このチュートリアルや､各チケットで作業する際は､ SQLite のテストで十分です｡しかし可能 (か必要な場合は) :ref:`他のデータベースでテストを実行する <running-unit-tests-settings>` を参照してください｡

source: For this tutorial, we expect that you have at least a basic understanding of how Django works.
ja: このチュートリアルは、少なくとも Django がどのように動作しているかの基本的な理解があることを想定しています。

source: For this tutorial, we'll be using ticket :ticket:`17549` as a case study, so we'll rewind Django's version history in git to before that ticket's patch was applied.
ja: このチュートリアルでは、ケーススタディとして :ticket:`17549` を用います。そのために、まず Django のバージョンをパッチが適用される前の git のバージョンに戻します。

source: For this tutorial, you'll need Git installed to download the current development version of Django and to generate patch files for the changes you make.
ja: このチュートリアルでは、最新の Django 開発版のダウンロードとその変更のパッチファイルを生成するために Git をインストールする必要があります。

source: For users who wish to use `virtualenv`__, you can use::
ja: `virtualenv`__ を利用したい場合は、次のコマンドを使います::

source: Fortunately, testing is a *very* big subject in computer programming, so there's lots of information out there:
ja: ですが実は､テスティングはプログラミングにおいて *とても* 重要なことです｡ここではテストについて詳細に紹介します：

source: From the command line, ``cd`` into a directory where you'd like to store your code, then run the following command:
ja: コマンドラインから、コードを置きたい場所に ``cd`` して、以下のコマンドを 実行してください。

source: From the command line, ``cd`` into the Django ``tests/`` directory and run::
ja: コマンドラインで ``tests/`` ディレクトリに ``cd`` して､以下を実行してください::
